{
  "_name_or_path": "airesearch/wangchanberta-base-att-spm-uncased",
  "architectures": [
    "CamembertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "\u0e16\u0e19\u0e19",
    "1": "\u0e04\u0e27\u0e32\u0e21\u0e2a\u0e30\u0e2d\u0e32\u0e14",
    "2": "\u0e41\u0e2a\u0e07\u0e2a\u0e27\u0e48\u0e32\u0e07",
    "3": "\u0e04\u0e27\u0e32\u0e21\u0e1b\u0e25\u0e2d\u0e14\u0e20\u0e31\u0e22",
    "4": "\u0e08\u0e23\u0e32\u0e08\u0e23",
    "5": "\u0e2d\u0e37\u0e48\u0e19 \u0e46"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "\u0e04\u0e27\u0e32\u0e21\u0e1b\u0e25\u0e2d\u0e14\u0e20\u0e31\u0e22": 3,
    "\u0e04\u0e27\u0e32\u0e21\u0e2a\u0e30\u0e2d\u0e32\u0e14": 1,
    "\u0e08\u0e23\u0e32\u0e08\u0e23": 4,
    "\u0e16\u0e19\u0e19": 0,
    "\u0e2d\u0e37\u0e48\u0e19 \u0e46": 5,
    "\u0e41\u0e2a\u0e07\u0e2a\u0e27\u0e48\u0e32\u0e07": 2
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "camembert",
  "num_attention_head": 12,
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.28.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 25005
}
